{
  "package-id" : "ans.fhir.fr.sdo",
  "title" : "Médicosocial - Suivi Décisions Orientation",
  "canonical" : "https://interop.esante.gouv.fr/ig/fhir/sdo",
  "introduction" : "Spécification des échanges d’information entre le Système d’Information de Suivi des Orientations (SI-SdO) et le Système d’Information des Etablissements et Services Médico-Sociaux (SI-ESMS) suite à une notification de décision d’orientation prise par la Commission des Droits et de l’Autonomie des Personnes Handicapées (CDAPH).",
  "category" : "Clinical Documents",
  "list" : [
    {
      "version" : "current",
      "desc" : "Continuous Integration Build",
      "path" : "https://ansforge.github.io/IG-fhir-medicosocial-suivi-decisions-orientation/ig/main",
      "status" : "ci-build"
    },
    {
      "version" : "4.0.1",
      "path" : "https://interop.esante.gouv.fr/ig/fhir/sdo/4.0.1",
      "status" : "release",
      "sequence" : "STU1",
      "fhirversion" : "4.0.1",
      "date" : "2023-09-08",
      "current" : true,
      "desc" : "Ce document présente les spécifications techniques du volet « SI-ESMS » (ST SI-ESMS). Ces dernières spécifient les échanges d’information entre le Système d’Information de Suivi des Orientations (SI-SdO) et le Système d'Information des Etablissements et Services Médico-Sociaux (SI-ESMS) suite à une notification de décision d’orientation prise par la Commission des Droits et de l’Autonomie des Personnes Handicapées (CDAPH).",
      "descmd" : "Release de l`Implementation Guide FHIR.\n- Inversion des éléments value et effectiveTime dans la section représentant les informations sur le décès d’un individu\n- Ajout des valeurs fixes des attributs @classCode = « OBS » et @moodCode = « EVN » dans les observations de la section représentant l’évaluation\n- Ajout du format root /extension pour l’identifiantDesDecisionsReviseesRenouveleesClotures et l’idNat de la section décision\n- Ajout de l’oid de l’autorité d’affectation de l’idNat (ASIP-Santé)\n- Remplacement des nomenclature ViaTrajectoire Statut et motif ESMS et unités par les nomenclatures équivalentes NOS\n- Codes à utiliser pour modePriseEnCharge de la section décision reformulés pour faciliter la compréhension\n- Mise à jour des urls des ressources de conformité FHIR => voir annexe 2 et ressources de conformité transmises\n- Suppression de la requête http PUT pour la mise à jour des tasks (1 taks = 1 évènement http POST). Mise à jour du diagramme du flux 4. Mise à jour du diagramme en annexe 6\n- Modification de la règle de gestion sur la date de naissance\n- Modification du clinicalDocument.templateID occurrence2\n- Mise à jour du diagramme de séquence en annexe 6\n- Modification des cardinalités des task.input unité et ajout de règles de gestion\n-Ajout d’une précision sur les codes d’erreurs accompagnés d’une ressource operationOutcome\n- Ajout de dispositions spécifiques à ce volet pour la section 4. Authentification et droits d’accès\n- Modification HTTP -> HTTPS\n- Ajout d’un niveau 0 et des attributs obligatoires fixés pour les Author et Custodian\nRessources de conformité FHIR\n- Modification des URL\n- task.input unité et ajout de règles de gestion\n- Ajout d’un bindng ves les JDV motif et statut\nExemples\n- Modification du clinicalDocument.templateID occurrence2\n- Suppression des références au dictionnaire de données\n- Correction de la correspondance des objets métiers DroitPrestation et Decision pour les flux 4, 5, 6 ;\n- Correction du diagramme de séquence en annexe 6 : flux 1.4 renvoie un documentReference seul et non un bundle\n- Suppression du guardianOrganization.name.other obsolète => le nom doit être renseigné directement au niveau de l’élément name\n- Ajout d’une contrainte sur l’élément meta de la ressource Consent\n- Modification du lien entre la ressource Consent et le DocumentReference. Provision.data.reference.reference remplacé par provision.data.reference.identifier\n- Mise à jour du tableau pour le mapping de la données idNat_Decision\n- Ajout du nom complet de la table d’association ASS_A32-StatutMotifPersonnePriseCharge dans la ressource Task\n- Corrections de coquilles + reformulations sans impact sur l’aspect technique\nRessourcesDeConformite\n- Mise à jour de la StructureDef de la ressource Consent\nExemple :\n- Mise à jour de l’exemple Consent"
    },
    {
      "version" : "2.4",
      "desc" : "Première version du volet ESMS en pdf",
      "path" : "https://esante.gouv.fr/sites/default/files/media_entity/documents/cisis-tec_specifications_techniques_si-esms_v2.4.pdf",
      "sequence" : "Trial Implementation",
      "status" : "trial-use",
      "fhirversion" : "4.0.1",
      "date" : "2023-01-31"
    }
  ]
}
